# utils
brew 'git'
brew 'fd'
brew 'jq'
brew 'ripgrep'
brew 'z'
brew 'ncdu'
brew 'neovim'
brew 'bat'
brew 'k9s'

# GNU
brew 'gawk'
brew 'gnu-indent'
brew 'gnu-sed'
brew 'gnu-tar'
brew 'gnu-which'
brew 'gnutls'
brew 'grep'
brew 'gzip'

brew 'coreutils'
brew 'binutils'
brew 'diffutils'
brew 'ed'
brew 'findutils'
brew 'watch'
brew 'wget'

# langs
brew 'pyenv'
brew 'npm'
brew 'clojure'
brew 'clojure-lsp/brew/clojure-lsp-native'
brew 'borkdude/brew/babashka'
brew 'leiningen'
brew 'go'

# cask
cask_args appdir: '/Applications'
cask 'stats'
cask 'docker'
cask 'temurin'

# cask 'google-chrome'
cask 'slack'
cask 'spotify'
cask 'iterm2'
cask 'gather'
cask 'rectangle'
cask 'visual-studio-code'
