# utils
brew 'git'
brew 'coreutils'
brew 'fd'
brew 'jq'
brew 'the_silver_searcher'
brew 'z'

# GNU
brew 'gawk'
brew 'gnu-indent'
brew 'gnu-sed'
brew 'gnu-tar'
brew 'gnu-which'
brew 'gnutls'
brew 'grep'
brew 'gzip'

brew 'coreutils'
brew 'binutils'
brew 'diffutils'
brew 'ed'
brew 'findutils'
brew 'httpie'
brew 'watch'
brew 'wget'

# langs
brew 'pyenv'
brew 'npm'
brew 'clojure'
brew 'leiningen'

# taps
tap "adoptopenjdk/openjdk"

# cask
cask_args appdir: '/Applications'
cask 'stats'
cask 'adoptopenjdk14'
cask 'docker'

# cask 'google-chrome'
# cask 'slack'
# cask 'spotify'
# cask 'iterm2'
