# utils
brew 'git'
brew 'fd'
brew 'jq'
brew 'ripgrep'
brew 'z'
brew 'ncdu'
brew 'bat'
brew 'fzf'

# GNU
brew 'gawk'
brew 'gnu-indent'
brew 'gnu-sed'
brew 'gnu-tar'
brew 'gnu-which'
brew 'gnutls'
brew 'grep'
brew 'gzip'

brew 'coreutils'
brew 'binutils'
brew 'diffutils'
brew 'ed'
brew 'findutils'
brew 'watch'
brew 'wget'

# langs
brew 'pyenv'

# cask
cask_args appdir: '/Applications'
cask 'stats'
cask 'temurin'
cask 'iterm2'
cask 'rectangle'
